import React, { PropTypes } from 'react';



class Blog extends React.Component {

  render (){

    return(
       <div className="blogcointaer"　style={{ width:'100%',padding:'0 10px'}}>
      <p>　突然想一想，我们竟然是陪伴彼此十几年的朋友了，都没曾厌倦过。你曾经说，我们太像了，
        　我也甚至觉得我们了解对方都快超过自己了，尽管偶尔会相隔一年未见面，却从未感到生疏过，
      　　我依旧能很热烈的投到你的怀抱，笑的没心没肺。跟你在一起是一种很简单很纯粹的快乐，可以卸下所有防备和盔甲。</p>
    <p>　　朋友换了一批又一批，真庆幸，你一直都在。我们并不缺朋友，可是我也坚信你也和我一样，觉得无论是谁都没法
      替代你。那个曾经在天真时光给过我光和热，能让我依赖和信任的人一直是你啊。我们也曾经幻想过一起拼搏，
      一起寻梦，一起分享彼此的幸福。请记住，无论遇到什么，我依旧会留一个肩膀和拥抱给你，做你最坚强的后盾。
      这不是说说而已，你知道，我小闫说到做到哦！有时候甚至觉得，你结婚我都会一边感动，一边不舍流泪，好在你
      可能嫁的不远，我们还是可以一年见一面的啊。
    </p>
    <p> 　其实，早就想着给你什么特别的礼物才不俗，后来想想发挥我的专长好了，这个网页真的用了一个星期搭建呢，
      由于招聘会和考试，这么晚才做完给你。 这个网页你可以永久访问的哦！做东西的时候才发现你发的照片真的不多哎，
      我们的合照竟然都找不到了，好遗憾，否则可以做个更多页面的网站，下次见面一定要多拍一点合照哦！
      我也想给你拍照呢，约你大马路街拍哈～
    </p>
    <p> 　你也找到你的幸福了，他对你真的挺好的，也真羡慕你能有一段这么久的恋爱，希望你们两长长久久，
      幸福美满，总觉得你们是奔着结婚去的。但是我却从来不敢谈结婚，我还是没决定好把一颗真心给谁，决定先流浪，
      也许有一天遇到一个人愿意陪我颠沛流离的人就结婚了呢。大学谈了两场恋爱，因为很多原因还是分手了，我不喜欢秀恩爱是因为
      总觉得有一天会失去，何必分享给别人看。大概是我太要强，让男朋友没有了存在感，又或许我内心缺少安全感，他们给不了吧。
    </p>
    <p>　　不得不承认，我们就这么长大了，竟然到了快要决定婚姻的时候，
    仿佛昨天还是那个攥着对方衣角害怕失去对方的人，那个傻乎乎传纸条觉得友谊不能分享的人，突然就长大了，
    我们已经不那么害怕失去了，因为我们知道是我们的其实是不会那么轻易失去的。尽管我们错失了对方很多的时间，
    成了拥有不同生活圈子的人，但这永远不能成为我们的隔阂，我们一样还是好强，独立，有着强烈自尊心，期望靠着自尊心过一辈子啊。
    我们还是很怀旧，无论经历了怎样的生活，我相信我们的感情是不会变的。
  </p>
      </div>
    )
  }
}

export default Blog;
