import React, { PropTypes } from 'react';



class Blog extends React.Component {

  render (){

    return(
       <div className="blogcointaer"　style={{ width:'100%',marginTop:'20px' ,padding:'0 10px'}}>
      <p>　突然想一想，我们竟然是陪伴彼此十几年的朋友了，都没曾厌倦过。你曾经说，我们太像了，
        　我也甚至觉得我们了解对方都快超过自己了，尽管偶尔会相隔一年未见面，却从未感到生疏过，
      　　我依旧能很热烈的投到你的怀抱，笑的没心没肺。</p>
    <p>
      朋友换了一批又一批，真庆幸，你一直都在。我们并不缺朋友，可是我也坚信你也和我一样，觉得无论是谁都没法
      替代你。那个曾经在天真时光给过我光和热，能让我依赖和信任的人一直是你啊。我们也曾经幻想过一起拼搏，
      一起寻梦，一起分享彼此的幸福。请记住，无论遇到什么，我依旧会留一个肩膀和拥抱给你，做你最坚强的后盾。
      这不是说说而已，你知道，我小闫说到做到哦！有时候甚至觉得，你结婚我都会一边感动，一边不舍流泪，好在你
      可能嫁的不远，我们还是可以一年见一面的啊。
    </p>
    <p>
      其实，早就想着给你什么特别的礼物才不俗，后来想想发挥我的专长好了，这个网页真的用了一个星期搭建呢，
      由于招聘会和考试，这么晚才做完给你。做东西的时候才发现你的照片真的不多哎，我们的合照竟然都找不到了，
      好遗憾，下次见面一定要多拍一点合照哦！我也想给你拍照呢，约你大马路街拍哈～
    </p>
      </div>
    )
  }
}

export default Blog;
